#
# 配列オブジェクト
#

puts "---- array ----"

a = [5, 8, 4]

p a[1] # 8

a[1] = 10

p a[1] # 10

# 範囲指定
p a[0..2]  # 0以上 2以下 [5, 10, 4]
p a[0...2] # 0以上 2未満 [5, 10]
p a[-1]    # 最後の値 4
p a[1, 2]  # 1から2つ [10, 4]

# 範囲指定で置き換え
p a

a[0...2] = [1, 2] # 0 ～ 1の配列を置き換える

p a # [1, 2, 4]

a[1, 0] = [10, 11, 12] # 1の後ろの0個分を置き換える

p a # [1, 10, 11, 12, 2, 4]

a[0, 2] = [] # 0ぁら2個分を置き換える

p a # [11, 12, 2, 4]

# 配列メソッド

p a.size         # 要素数
p a.sort         # 並び替え（昇順）
p a.sort.reverse # 並び変えて逆順（降順）
p a.push(100)    # 末尾に追加

# 末尾に追加のショートカット
a << 101 << 102
p a # [11, 12, 2, 4, 100, 101, 102]
